In [55]:
import pandas as pd

In [56]:
devs = pd.read_csv('/Users/medhasubramaniyan/Desktop/GitHub_Repos/Stats-Practice/data/development_indicators.csv')
planes = pd.read_csv('/Users/medhasubramaniyan/Desktop/GitHub_Repos/Stats-Practice/data/planes.csv')
divorce = pd.read_csv('/Users/medhasubramaniyan/Desktop/GitHub_Repos/Stats-Practice/data/divorce.csv')
games = pd.read_csv('/Users/medhasubramaniyan/Desktop/GitHub_Repos/Stats-Practice/data/Video Games - Sales.csv')

# Part 1

In [57]:
devs

,Year,Continent,Sub Region,Country,GDP per Capita,GDP per Capita (Grouped),Life Expectancy,Life Expectancy (Grouped),C02 Emissions per Person (Tonnes),Child Mortality Rate (per 1000 births)
0,1960,Asia,Southern Asia,Afghanistan,1210,<5000,38.6,0-40,0.0461,364.0
1,1960,Europe,Southern Europe,Albania,2790,<5000,62.7,>60,1.2400,188.0
2,1960,Africa,Northern Africa,Algeria,6520,>= 5000 and <20000,52.0,>=50 and <= 60,0.5540,245.0
3,1960,Europe,Southern Europe,Andorra,15200,>= 5000 and <20000,NaN,NaN,NaN,NaN
4,1960,Africa,Middle Africa,Angola,3860,<5000,42.4,>=40 and < 50,0.0975,305.0
...,...,...,...,...,...,...,...,...,...,...
8905,2000,Oceania,Micronesia,Kiribati,2010,<5000,59.5,>=50 and <= 60,0.3480,70.6
8906,2001,Oceania,Micronesia,Kiribati,1940,<5000,59.7,>=50 and <= 60,0.2990,68.6
8907,2002,Oceania,Micronesia,Kiribati,1980,<5000,59.8,>=50 and <= 60,0.4620,66.9
8908,2003,Oceania,Micronesia,Kiribati,1990,<5000,59.9,>=50 and <= 60,0.4540,65.7
8909,2004,Oceania,Micronesia,Kiribati,1920,<5000,60.0,>=50 and <= 60,0.4860,65.0

- A partial population of all possible country–year records
- sample (The subset of countries and years actually included in this dataset)
- lets examine mean gdp across countries in a given year

In [58]:
planes

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
0,Jet Airways,9/06/2019,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,No info,13882.0
1,IndiGo,12/05/2019,Kolkata,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,No info,6218.0
2,IndiGo,01/03/2019,Banglore,New Delhi,BLR → NAG → DEL,16:50,21:35,4h 45m,1 stop,No info,13302.0
3,SpiceJet,24/06/2019,Kolkata,Banglore,CCU → BLR,09:00,11:25,2h 25m,non-stop,No info,3873.0
4,Jet Airways,12/03/2019,Banglore,New Delhi,BLR → BOM → DEL,18:55,10:25 13 Mar,15h 30m,1 stop,In-flight meal not included,11087.0
...,...,...,...,...,...,...,...,...,...,...,...
10655,Air Asia,9/04/2019,Kolkata,Banglore,CCU → BLR,19:55,22:25,2h 30m,non-stop,No info,4107.0
10656,Air India,27/04/2019,Kolkata,Banglore,CCU → BLR,20:45,23:20,2h 35m,non-stop,No info,4145.0
10657,Jet Airways,27/04/2019,Banglore,Delhi,BLR → DEL,NaN,11:20,3h,non-stop,NaN,7229.0
10658,Vistara,01/03/2019,Banglore,New Delhi,BLR → DEL,11:30,14:10,2h 40m,non-stop,No info,12648.0
10659,Air India,9/05/2019,Delhi,Cochin,DEL → GOI → BOM → COK,10:55,19:15,8h 20m,2 stops,No info,11753.0

- sample or partial population, because It likely excludes planes outside a certain registry, country, or time period and Not every plane ever built is included
- lets examine Mean aircraft age

In [59]:
divorce

,divorce_date,dob_man,education_man,income_man,dob_woman,education_woman,income_woman,marriage_date,marriage_duration,num_kids
0,2006-09-06,1975-12-18,Secondary,2000.0,1983-08-01,Secondary,1800.0,2000-06-26,5.0,1.0
1,2008-01-02,1976-11-17,Professional,6000.0,1977-03-13,Professional,6000.0,2001-09-02,7.0,NaN
2,2011-01-02,1969-04-06,Preparatory,5000.0,1970-02-16,Professional,5000.0,2000-02-02,2.0,2.0
3,2011-01-02,1979-11-13,Secondary,12000.0,1981-05-13,Secondary,12000.0,2006-05-13,2.0,NaN
4,2011-01-02,1982-09-20,Professional,6000.0,1988-01-30,Professional,10000.0,2007-08-06,3.0,NaN
...,...,...,...,...,...,...,...,...,...,...
2204,2006-10-31,1969-11-27,Professional,6000.0,1975-09-01,Professional,14000.0,2002-03-08,4.0,NaN
2205,2006-10-31,1970-09-17,Professional,6000.0,1977-07-22,Professional,6000.0,2002-03-22,4.0,NaN
2206,2011-10-31,1976-03-11,Professional,8000.0,1978-12-28,Professional,7000.0,2009-02-10,2.0,NaN
2207,2012-10-31,1977-10-29,Professional,12500.0,1978-12-01,Professional,6000.0,2008-10-25,3.0,NaN
2208,2013-12-31,1960-06-22,Professional,20000.0,1972-01-22,Professional,20000.0,2009-08-22,4.0,NaN

- this is a partial population, becauseIt may not include every marriage or individual-level outcome
- samples is The state–year divorce records included in the dataset
- lets examine Mean divorce rate across states

In [60]:
games

,Name,Platform,Release Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,Wii Sports,Wii,2006,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,Super Mario Bros.,NES,1985,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,Mario Kart Wii,Wii,2008,Racing,Nintendo,15.85,12.88,3.79,3.31,35.83
3,Wii Sports Resort,Wii,2009,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,Pokemon Red/Pokemon Blue,GB,1996,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.38
...,...,...,...,...,...,...,...,...,...,...
12436,Command & Conquer 4: Tiberian Twilight,PC,2010,Strategy,Electronic Arts,0.00,0.01,0.00,0.00,0.01
12437,Winter Sports 3: The Great Tournament,X360,2010,Sports,Other,0.00,0.01,0.00,0.00,0.01
12438,GTI Club: Supermini Festa!,Wii,2010,Racing,Other,0.01,0.00,0.00,0.00,0.01
12439,Magic Encyclopedia: Moonlight,DS,2010,Misc,Other,0.00,0.01,0.00,0.00,0.01
12440,SCORE International Baja 1000: The Official Game,PS2,2008,Racing,Activision,0.00,0.00,0.00,0.00,0.00

- A sample, because it includes only games tracked by the data source and smaller or less-documented releases may be missing
- the sample is The set of video games listed in the dataset
- lets examine Average sales by genre or platform

# Part 2

In [61]:
planes[planes['Price'].isna()] # there are 616 null rows!

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
60,Multiple carriers,3/06/2019,Delhi,Cochin,DEL → BOM → COK,08:45,19:00,10h 15m,1 stop,No info,NaN
76,Jet Airways,15/06/2019,Delhi,Cochin,DEL → BOM → COK,17:30,12:35 16 Jun,19h 5m,1 stop,In-flight meal not included,NaN
89,Multiple carriers,6/03/2019,Delhi,Cochin,DEL → BOM → COK,02:15,13:20,11h 5m,1 stop,No info,NaN
98,Jet Airways,15/05/2019,Kolkata,NaN,CCU → BOM → BLR,08:25,20:45,12h 20m,1 stop,NaN,NaN
99,Jet Airways,9/06/2019,Kolkata,Banglore,CCU → BOM → BLR,20:00,08:15 10 Jun,12h 15m,1 stop,No info,NaN
...,...,...,...,...,...,...,...,...,...,...,...
10578,Multiple carriers,6/03/2019,Delhi,Cochin,DEL → BOM → COK,10:20,21:00,10h 40m,1 stop,No info,NaN
10585,Jet Airways,12/05/2019,Kolkata,Banglore,CCU → BOM → BLR,06:30,04:40 13 May,22h 10m,1 stop,In-flight meal not included,NaN
10592,Jet Airways,1/04/2019,Banglore,Delhi,BLR → DEL,15:15,18:10,NaN,NaN,No info,NaN
10598,IndiGo,NaN,Kolkata,Banglore,CCU → BLR,22:15,00:50 28 Jun,2h 35m,non-stop,No info,NaN
10653,Multiple carriers,1/05/2019,Delhi,Cochin,DEL → BOM → COK,10:20,19:00,8h 40m,1 stop,No info,NaN

In [62]:
planes = planes[~planes['Price'].isna()]

In [63]:
samp_price = planes['Price'].sample(n=30)

In [64]:
pop_mean = planes['Price'].mean() #populaton mean 9044
samp_mean = samp_price.mean() # sample mean 10640.4

In [65]:
abs_diff = abs(pop_mean - samp_mean)
abs_diff

np.float64(581.8445240939855)

In [69]:
sampMeans = []
for i in range(5):
    samp_test = planes['Price'].sample(n=30, replace=True)
    mean = samp_test.mean()
    sampMeans.append(mean)

In [70]:
sampMeans

[np.float64(9741.266666666666),
 np.float64(8467.766666666666),
 np.float64(9070.0),
 np.float64(9397.566666666668),
 np.float64(8214.9)]

In [78]:
for i in range(len(sampMeans)):
    print('Absolute difference btwn sample and pop mean', abs(sampMeans[i] - pop_mean))

Absolute difference btwn sample and pop mean 696.8554759060135
Absolute difference btwn sample and pop mean 576.6445240939865
Absolute difference btwn sample and pop mean 25.58880923934703
Absolute difference btwn sample and pop mean 353.15547590601454
Absolute difference btwn sample and pop mean 829.5111907606533

I colleceted 5 sample means, and recorded the absolute difference between them and the population mean. The absolute differences range from 25-830